Tekla Open API Reference for Tekla Structures 2025
InvalidFilterExpressionException Constructor (Expression, InvalidFilterExpressionExceptionReasonsType, Int32)
 Initializes a new instance of the InvalidFilterExpressionException class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InvalidFilterExpressionException(
	Expression Expression,
	InvalidFilterExpressionExceptionReasonsType InvalidFilterExpressionExceptionReasonsType,
	int MaximumExpressionNumber
)
Public Sub New (
	Expression As Expression,
	InvalidFilterExpressionExceptionReasonsType As InvalidFilterExpressionExceptionReasonsType,
	MaximumExpressionNumber As Integer
)
Parameters
Expression
Type: Tekla.Structures.Filtering.Expression
The invalid expression.
InvalidFilterExpressionExceptionReasonsType
Type: Tekla.Structures.Filtering.InvalidFilterExpressionExceptionReasonsType
The reason why the exception is thrown.
MaximumExpressionNumber
Type: System.Int32
The maximun number of expressions.
See Also
Reference
InvalidFilterExpressionException Class
InvalidFilterExpressionException Overload
Tekla.Structures.Filtering Namespace